app/views/dashboard/_station_spotlight.html.erb

SELECT "ping_results".* FROM "ping_results" WHERE "ping_results"."station_id" = ? ORDER BY "ping_results"."id" DESC LIMIT ?  [["station_id", 3], ["LIMIT", 1]]
---
  <p class="text-sm text-gray-600">Last ping:
    <%= station.ping_results.last&.created_at&.strftime("%Y-%m-%d %H:%M") || "N/A" %>