app/views/dashboard/index.html.erb

SELECT "ping_results"."created_at" FROM "ping_results" ORDER BY "ping_results"."created_at" DESC LIMIT ?  [["LIMIT", 1]]
---
                </td>
                <td class="px-4 py-2 text-gray-600"><%= station.ping_results.last&.created_at&.strftime("%Y-%m-%d %H:%M") || "N/A" %></td>