app/views/stations/_ping_result.html.erb

SELECT "ping_results".* FROM "ping_results" WHERE "ping_results"."station_id" = ? ORDER BY "ping_results"."timestamp" DESC LIMIT ?  [["station_id", 2], ["LIMIT", 1]]
---
<% last_ping = station.ping_results.order(timestamp: :desc).first %>