app/views/stations/_station.html.erb


<% last_ping = station.ping_results.last %>
---
SELECT "ping_results".* FROM "ping_results" WHERE "ping_results"."station_id" = ? ORDER BY "ping_results"."id" DESC LIMIT ?  [["station_id", 6], ["LIMIT", 1]]

        <%# Fallback: count failed pings in the last 6h without calling a missing method %>
        <span><%= station.ping_results.where(success: false).where('created_at >= ?', 6.hours.ago).count %></span>
---
SELECT COUNT(*) FROM "ping_results" WHERE "ping_results"."station_id" = ? AND (COALESCE(timestamp, created_at) BETWEEN '2025-08-18 13:24:55.670362' AND '2025-08-18 19:24:55.670451') AND "ping_results"."success" = ?  [["station_id", 6], ["success", 0]]