app/views/stations/_station.html.erb

SELECT "ping_results".* FROM "ping_results" WHERE "ping_results"."station_id" = ? ORDER BY "ping_results"."timestamp" DESC LIMIT ?  [["station_id", 71], ["LIMIT", 1]]
---
  <%= turbo_frame_tag "ping_result_#{station.id}" do %>
    <% last_ping = station.ping_results.order(timestamp: :desc).first %>