app/controllers/dashboard_controller.rb

  def index
    @summary = {}

    stations_ready = ActiveRecord::Base.connection.data_source_exists?('stations')
    pings_ready    = ActiveRecord::Base.connection.data_source_exists?('ping_results')
    reads_ready    = ActiveRecord::Base.connection.data_source_exists?('readings')

    if stations_ready
      @summary["Stations"] = Station.count
---
SELECT COUNT(*) FROM "stations"