app/controllers/dashboard_controller.rb

SELECT COUNT(*) FROM "readings" WHERE (taken_at >= '2025-08-14 19:12:35.380322')
SELECT MAX(COALESCE(timestamp, created_at)) FROM "ping_results" WHERE "ping_results"."station_id" = ? LIMIT ?  [["station_id", 5], ["LIMIT", 1]]
SELECT "stations".* FROM "stations" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 3]]
SELECT "ping_results".* FROM "ping_results" WHERE "ping_results"."station_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT COUNT(*) FROM "ping_results" WHERE "ping_results"."station_id" = ? AND (COALESCE(timestamp, created_at) BETWEEN '2025-08-18 13:45:31.029707' AND '2025-08-18 19:45:31.029737') AND "ping_results"."success" = ?  [["station_id", 5], ["success", 0]]
SELECT "stations".* FROM "stations" ORDER BY "stations"."id" ASC LIMIT ?  [["LIMIT", 1000]]
---
  def index
    # ---- Summary (kept defensive) ----
    @summary = {
      "Stations"       => table?(:stations)     ? Station.count : 0,
      "Pings (24h)"    => table?(:ping_results) ? PingResult.where('created_at >= ?', 24.hours.ago).count : 0,
      "Readings (24h)" => table?(:readings)     ? Reading.where('taken_at >= ?', 24.hours.ago).count : 0,
      "Last Ping"      => table?(:ping_results) ? PingResult.order(created_at: :desc).limit(1).pick(:created_at)&.in_time_zone&.strftime("%Y-%m-%d %H:%M") : "—"
    }

    # Always provide arrays so views can safely call .any?/.each
    @flagged_stations  = []
    @random_spotlight  = []

    return unless table?(:stations)

    # ---- Station Spotlight (3 random) ----
    random_sql = case ActiveRecord::Base.connection.adapter_name
                 when /sqlite/i, /postgres/i then 'RANDOM()'
                 else 'RAND()' # MySQL / MariaDB
                 end
    @random_spotlight = Station.order(Arel.sql(random_sql)).limit(3).to_a

    # ---- Flagged stations (bulk, no N+1) ----
    return unless table?(:ping_results)

    cutoff_24h = 24.hours.ago

    # 1) Last ping per station (single query)
    last_ping_map = PingResult.group(:station_id).maximum(:created_at)
    # 2) Recent failure counts (single query)
    recent_failures = PingResult.where('created_at >= ?', 6.hours.ago)
                                .where(success: false)
                                .group(:station_id).count

    Station.find_each do |s|