app/controllers/stations_controller.rb

  def index
    @q      = params[:q].to_s.strip
    @status = params[:status].to_s.strip # "", "reachable", "unreachable"

    @stations = Station.search(@q).order(:name)

    case @status
    when "reachable"
      @stations = @stations.select(&:last_ping_success?)
    when "unreachable"
      @stations = @stations.reject(&:last_ping_success?)
    when "active"
      @stations = @stations.where(active: true)
---
SELECT "stations".* FROM "stations" WHERE (LOWER(name) LIKE '%1.1.1.%' OR LOWER(ip_address) LIKE '%1.1.1.%') ORDER BY "stations"."name" ASC
SELECT "stations".* FROM "stations"
SELECT "stations".* FROM "stations" WHERE "stations"."active" = ? ORDER BY "stations"."name" ASC  [["active", 1]]

  def import
    file = params[:file]
    if file.nil?
      redirect_to stations_path, alert: "Please select a CSV file to import" and return
    end

    imported = 0
    CSV.foreach(file.path, headers: true) do |row|
      Station.create!(row.to_hash)
---
INSERT INTO "stations" ("name", "ip_address", "location", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "StationName"], ["ip_address", "Init_Expected_IP"], ["location", nil], ["notes", "nil"], ["created_at", "2025-07-24 06:48:16.278035"], ["updated_at", "2025-07-24 06:48:16.278035"]]

  def create
    @station = Station.new(station_params)
    if @station.save
---
INSERT INTO "stations" ("name", "ip_address", "location", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "test_s1"], ["ip_address", "127.0.0.1"], ["location", "me"], ["notes", "loop back"], ["created_at", "2025-07-24 06:35:53.103988"], ["updated_at", "2025-07-24 06:35:53.103988"]]

  def update
    if @station.update(station_params)
---
UPDATE "stations" SET "updated_at" = ?, "ingest_parameters" = ? WHERE "stations"."id" = ?  [["updated_at", "2025-08-19 20:08:27.298630"], ["ingest_parameters", "{}"], ["id", 6]]

  def destroy
    @station.destroy!
---
DELETE FROM "stations" WHERE "stations"."id" = ?  [["id", 2]]

  def ping
    ip = @station.ip_address

    if Gem.win_platform?
      output  = `ping -n 1 -w 1000 #{ip}`
      success = $?.exitstatus == 0
      latency = output[/Average = (\d+)ms/, 1]&.to_i
    else
      output  = `ping -c 1 -W 1 #{ip}`
      success = $?.exitstatus == 0
      latency = output[/time=(\d+(?:\.\d+)?) ms/, 1]&.to_f&.round
    end

    @station.ping_results.create!(timestamp: Time.current, latency_ms: latency, success: success)
---
INSERT INTO "ping_results" ("station_id", "latency_ms", "timestamp", "success", "failure_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def set_station
    @station = Station.find(params[:id])
---
SELECT "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT ?  [["id", 72], ["LIMIT", 1]]